app/controllers/answers_controller.rb

  def index
    @answers = Answer.all
---
SELECT "answers".* FROM "answers"

  def show
puts 'test_kiteru'

#    @answer = Answer.find(params[:id])
    @answers = Answer.find(:all, :conditions=>[ "what_id=?", params[:id]])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @answer = Answer.new(params[:answer])

    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("created_at", "do_description", "name", "updated_at", "what_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 02 Jun 2012 10:53:40 UTC +00:00], ["do_description", "anss"], ["name", "sss"], ["updated_at", Sat, 02 Jun 2012 10:53:40 UTC +00:00], ["what_id", nil]]